{
  "name": "SoundSync",
  "start_date": "September 5th 2024",
  "end_date": "December 20th 2024",
  "revisited_date": "",
  "revisited_desctiption": "",
  "status": "Not Completed",
  "overview": "This project was a mobile app developed for the class CS-360 Mobile Architect & Programming in a group of three other people. The portion of this app I ended up working on was the service layer working in python with the Spotify and Flask APIs. The other portions we had was a machine learning side developed by one group mate and the front end developed by two other group mates. This section was developed to authenticate the user, gather modifiable playlists, songs in each playlist, recommended songs for each playlist, and add songs to a specified playlist. This was set up using the flask API to send playlists to the front end as well as a recommended queue gotten from the machine learning model that would send back which songs were above a threshold that the user would like the songs. It would also recieve a request to add a song from the front end. This service layer would also provide all the data for the song such as song id, song name, song preview, song album cover, and song artist to the front end and to the machine learning model would send data for each song for example temp, dancability, energy, loudness, etc.",
  "description": "This project is designed to connect to a users spotify account and recommend songs based on a machine learning model of songs the users rejects, accepts, and the type of songs in the playlist. As the user use the app more and more for a specific playlist the machine learning model will get better at recommending songs. This would be done for the user to sign in on a log in screen using Spotify's authentication. The user then gets taken to the main screen where they can select a playlist from a drop down. Then they will start getting recommended songs on the main screen showing the album cover, song name, song artist, and the preview of the song. The user then has a choice to swipe to the right which will add to the playlist and have a positive effect on the machine learning model, swipe left for a negative effect, and swipe up or down for a neutral effect.",
  "what_i_learned": "During this project I learned a lot about how to work in a scrum based setting with weekly sprints. I also learned a lot about how to develop a service laying creating a Flask API and using Spotify's API. This also allowed me to gain more experience in the development of a mobile app from start to finish with having to create mockups of the app and present and show what we have throughout the development.",
  "challenges": "",
  "What_was_not_completed": "The features we didn't get time to complete was the ability authenticate the user on the front end, select a specific playlist, and retrain the machine learning model as positive and negative effects were added.",
  "cover_image": "assets/project-images/SoundSync-Images/Image1.png",
  "images": [
    {
      "title": "Application Walkthough",
      "path":"assets/project-images/SoundSync-Images/Video1.mp4"
    }
  ],
  "resources": {
    "Spotipy API Documentation": "https://spotipy.readthedocs.io/en/2.24.0/",
    "Spotify API Documentation": "https://developer.spotify.com/documentation/web-api"
  },
  "featured": false,
  "tags": [
    "Python",
    "Kotlin",
    "Machine Learning",
    "Mobile Development",
    "Software"
  ]
}