{
  "name": "Clone Hero Guitar Version 2",
  "start_date": "December 4th 2024",
  "end_date": "Present",
  "revisited_date": "",
  "revisited_desctiption": "",
  "status": "In Progress",
  "overview": "The Clone Hero Guitar v2 project began as a collaborative effort with a friend who was nearing graduation. Sharing a mutual passion for Clone Hero, we decided to build upon the foundation of my previous project, the Clone Hero Guitar v1, with a focus on incorporating more advanced technology and features. To achieve this, we selected a new 3D model for the guitar body and designed the project to output controller signals. We also integrated several enhancements, including LED lights that respond to button presses, an ESP32 module for Bluetooth connectivity, and a USB hub with a flash drive to store the game and songs. This allows for a convenient plug-and-play experience on any computer, even if the game isn't pre-installed. While still in progress, this project showcases our shared creativity and technical expertise.",
  "description": "This project is a Clone Hero Guitar and is the version 2. Similar to the version 1 it was designed to play Clone Hero which is a game similar to Guitar Hero but for the PC. This project incorporates a lot more features such as the ability to use it wireless over Bluetooth with a battery to power the guitar as well as the ability to store the game and songs onto the guitar itself to make its a plug and play guitar without having to install anything on other computers. This guitar can do keyboard outputs or controller outputs however is programmed to do controller outputs. This guitar will also function on Windows, Linux, and MacOS but was built to primarily run on Windows 10/11.",
  "what_i_learned": "This project provided numerous learning opportunities. While I started with some basic soldering skills, I refined and expanded my knowledge significantly as the project progressed. I also ventured into 3D modeling, modifying a part of the guitar to accommodate a power switch for the board. Additionally, I learned how to wire and program an LED strip to display specific colors, enhancing the controller’s functionality and aesthetic. Overall, this project deepened my understanding of both hardware and software, as well as the process of integrating them to create a fully functioning, cohesive system.",
  "challenges": "One of the biggest challenges I am currently facing is trying to lean how rechargeable batteries work with being wired to a charger and to the micro controller. I can not get the battery to charge through the charger and the battery will not power the board even with the battery having full charge when tested with a multi meter. I plan to do more research on batteries to find a proper one with a charger to power this guitar.",
  "What_was_not_completed": "",
  "cover_image": "assets/project-images/Clonehero-Guitar-V2-Images/Image1.JPEG",
  "images": [
    {
      "title": "",
      "path":"assets/project-images/Clonehero-Guitar-V2-Images/Image1.JPEG"
    },
    {
      "title": "",
      "path":"assets/project-images/Clonehero-Guitar-V2-Images/Image2.JPEG"
    },
    {
      "title": "Guitar Interior",
      "path":"assets/project-images/Clonehero-Guitar-V2-Images/Image3.JPEG"
    }
  ],
  "resources": {
    "Guitar Model on Printables": "https://www.printables.com/model/233903-les-paul-clone-hero-controller-3-button-body-remix"
  },
  "featured": true,
  "tags": [
    "3d Printing",
    "Arduino",
    "Embeded Systems",
    "C++"
  ]
}