{
  "name": "Scale Stop Light",
  "start_date": "September 4th 2025",
  "end_date": "Present",
  "revisited_date": "",
  "revisited_desctiption": "",
  "status": "In Progress",
  "overview": "This project is part of EG-361: Introduction to Autonomous Robots. It was assigned to me and a classmate as an extra challenge, based on our previous experience in related coursework. Our team consisted of one Computer Science major and one Engineering major, allowing us to collaborate across disciplines. The primary goal was to design and build a functional stoplight system that could eventually be used in a scaled environment with autonomous robotic cars. Although autonomous robotic cars will be introduced in a later phase of the course, we were tasked with ensuring that the stoplight would be compatible with the PixyCam2—specifically testing whether the camera could detect the light at the correct height and brightness. This validation step was essential to ensure that the future robotic vehicles would be able to recognize and respond to the stoplight during later integration.",
  "description": "This project focuses on building a realistic intersection stoplight system for a scaled-down environment. The stoplight will eventually be used with robotic cars in a future portion of the course, but the primary task was to create the light itself. The structure is constructed using a combination of metal extrusions and custom 3D-printed parts. The lights are mounted using magnets and pogo pins, allowing for both secure attachment and efficient power transfer. Because the lights require between 8.5V and 9V, they are powered by an external supply, with relays controlled by an Arduino Uno to manage the light sequence. The system mimics real-world traffic behavior and includes adjustable timing variables. As part of the testing process, a PixyCam2 will be used to confirm that the light is bright and high enough to be detected by a camera mounted on a future robotic car.",
  "what_i_learned": "As we work through this project, I’m gaining a stronger understanding of how relays operate, including how to determine the correct voltage requirements and safely integrate them into a circuit. I’m also learning how to work with metal extrusion for building structural components, which is new to me. In addition, I’ve started exploring how the PixyCam2 functions, particularly how it detects bright lights and how to fine-tune its settings for accurate color recognition.",
  "challenges": "One of the challenges we’re currently facing is with the PixyCam2—when the LEDs are too bright, the camera reads all the lights as white, making it difficult to distinguish between colors. To address this, we’re experimenting with multiple solutions: adjusting the camera’s brightness settings, lowering the voltage supplied to the LEDs, and designing a diffuser that will sit in front of each LED to soften the light output. Another issue has been identifying the correct voltage specifications for the relays we were given. With guidance from our professor, we were able to confirm the appropriate voltage range to ensure reliable and stable operation.",
  "What_was_not_completed": "",
  "cover_image": "",
  "images": [
  ],
  "resources": {

  },
  "featured": true,
  "tags": [
    "3d Modeling",
    "3d Printing",
    "Embedded Systems",
    "C++",
    "Arduino"
  ]
}