{
  "name": "Personal Website Portfolio",
  "start_date": "May 18th 2025",
  "end_date": "Present",
  "revisited_date": "",
  "revisited_desctiption": "",
  "status": "In Progress",
  "overview": "This website project was created to test and expand my skills in web development, with a particular focus on front-end technologies. The primary goal was to upgrade my previous portfolio, which was built using Google Sites, and develop a more professional and customized platform that would help me stand out. In addition to showcasing my technical skills, this project also allowed me to explore web hosting and design a scalable system for managing and presenting my work.",
  "description": "The website is built using Angular and serves as a portfolio to highlight my projects, technical skills, and professional background. It also acts as a central hub linking to my resume and external profiles. The site is designed for easy expansion—new projects can be added by creating a simple JSON file containing project details, then rebuilding and deploying the site to GitHub Pages. The website runs entirely for free using GitHub’s hosting services and is optimized for maintainability and scalability. Additionally, it integrates with my 3D-printed business cards through NFC technology, allowing users to tap the card with their phone and be directed to the site instantly.",
  "what_i_learned": "Throughout this project, I gained hands-on experience with both front-end and back-end aspects of web development, particularly using the Angular framework. I learned how to structure a modular, multi-page application with reusable components and dynamic content driven by JSON files. I also developed a better understanding of how to manage routing across multiple pages, such as Home, Projects, Skills, and Contact. Additionally, I learned how to deploy and maintain the website using GitHub Pages, gaining insight into its capabilities and limitations as a free hosting solution. Overall, this project helped solidify my understanding of modern web development practices and deployment workflows.",
  "challenges": "One of the initial challenges was setting up the Angular project from scratch, as my previous experience with Angular involved working on an already configured codebase. I also had to determine the best approach for storing and retrieving project data in a way that was both flexible and easy to update. Finally, hosting the site on GitHub Pages presented some issues—particularly with routing, asset loading, and relative paths. After consulting documentation and researching error messages, I was able to troubleshoot and implement the necessary fixes to get everything running smoothly.",
  "What_was_not_completed": "",
  "cover_image": "assets/project-images/Website-Portfolio-Images/Image1.png",
  "images": [
  ],
  "resources": {
    "Former Website": "https://sites.google.com/view/adamwilkinsportfolio/home",
    "Angular Documentation": "https://angular.dev/overview"
  },
  "featured": true,
  "tags": [
    "HTML",
    "CSS",
    "TypeScript",
    "Angular",
    "Software"
  ]
}