{
  "name": "Mosaic",
  "start_date": "August 30th 2023",
  "end_date": "December 15th 2023",
  "revisited_date": "",
  "revisited_desctiption": "",
  "status": "Not Completed",
  "overview": "This was a mobile app developed in CS-250 Software Development Lifecycles in a group of five other people. I portion I ended up working on was the front end design on the application. We used React Native with TypeScript to program this app. We also had a database conneted to the application. Each developer as they developed a page would also work on the back end and get it connected to the database. During this class we learned the lifecycle by being able to test each role. After each sprint we would switch roles and we would always have two developers, two testers, one scrum master, and one product owner. We used Jira as our project management software and would do standups each time our group met to see problems eachother may have had and see if there is a group member that can help.",
  "description": "This application was designed with small bussiness in mind. There are many different application that every bussiness has and it can be difficult for small bussineses to compete in a market especcially when small bussiness may not have the money to run and/or develop a mobile app. The owner could create a company and add products as well as add other users that are part of the company. The customers could select a product or service and pay for it though the app. The company side would get requests for the products or services. The workers could accept or deny requests for services. There would also be two sides the user can sign in as a customer and/or create an account or they can sign in to a worker account or create a company. This would also allow the customer to see companies that are in their area if they add an address or a zip code.",
  "what_i_learned": "I learned a lot on the lifecycle of software's and the different roles that go into development. Being the product owner i learned how to communicate the products requirements effectively with the team. When i was the scrum master i was able to assign tasks and assist the team where needed. Being a developer or tester i was able to complete the tasks that were assigned to me within a reasonable time. Lastly thought out this project i was able to gain the knowledge of how a project management software works and the importance of keeping it updated and how to create, assign, test, and complete issues.",
  "challenges": "",
  "What_was_not_completed": "We didnt get to complete the ability for the user to pay or add in any addresses which also doesnt have the suggested companies that are in a specific area. We were able to complete a sign in function and build an app that shows what the future of it could look like. This project was not completed as it was a class project and the group moved away into other classes afterwards.",
  "cover_image": "/assets/project-images/Mosaic-Images/Image1.png",
  "images": [
    {
      "title": "Application Walkthough",
      "path":"/assets/project-images/Mosaic-Images/Video1.mp4"
    }
  ],
  "resources": {
  },
  "tags": [
    "TypeScript",
    "JavaScript",
    "Software"
  ]
}